БухЭксп/Catalogs/CW_СистемныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_СистемныеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ИсточникиСистемныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПриоритетыСистемныхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСсылок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеСообщения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_СистемныеСообщения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура Добавить(Источник,Сообщение) Экспорт 
		// --- 
		
		УстановитьПривилегированныйРежим(Истина);
		
		Попытка
			
			НовоеСообщение = Справочники.CW_СистемныеСообщения.СоздатьЭлемент();
			НовоеСообщение.Дата = ТекущаяДата();
			НовоеСообщение.Источник = Источник;
			НовоеСообщение.Сообщение = Сообщение;
			НовоеСообщение.Записать();
			
			// --- 
			
			УчетнаяЗаписьСистемныхСообщений = Константы.УчетнаяЗаписьДляСистемныхСообщений.Получить();
			ПолучателиСистемныхСообщений = Константы.ЭлектронныеАдресаПолучателейСистемныхСообщений.Получить();
			
			Если (НЕ УчетнаяЗаписьСистемныхСообщений.Пустая()) И (НЕ СокрЛП(ПолучателиСистемныхСообщений)="") Тогда
				
				// --- 
				
				// формируем письмо
				
				СтруктураПисьма = _ЭП.СтруктураПисьма();
				СтруктураПисьма.Отправитель = УчетнаяЗаписьСистемныхСообщений.Наименование;
				СтруктураПисьма.Получатели = _сф.сп_СоздатьИзСтроки(СтрЗаменить(ПолучателиСистемныхСообщений,",",";"),";");
				// --- 
				СтруктураПисьма.Тема = "[БАЛ] "+НовоеСообщение.Источник;
				СтруктураПисьма.Тело = "Системное сообщение: "+ПолучитьНавигационнуюСсылку(НовоеСообщение.Ссылка)+Символы.ПС+НовоеСообщение.Сообщение;
				
				Ответ = _ЭП.ОтправитьПисьмо(СтруктураПисьма,УчетнаяЗаписьСистемныхСообщений);
				Если Ответ.Код <> 0 Тогда
					
					ЗаписьЖурналаРегистрации("ИБ.СистемноеСообщение",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки()+"; Сообщение:"+Сообщение);
					
				КонецЕсли; 
				
				// --- 
				
			КонецЕсли; 
			
		Исключение
			
			ЗаписьЖурналаРегистрации("ИБ.СистемноеСообщение",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки()+"; Сообщение:"+Сообщение);
			
		КонецПопытки; 
		
		
		// --- 
	КонецПроцедуры
	
#КонецЕсли
